{"intents": [
        {"tag": "greeting",
         "patterns": ["Hi","Hi there","How are you","Is anyone there?","Hey","Hola","Hello","How's it going?","What's up?","Is anyone there?","Hay","Good day","Good morning","Good evening","Good afternoon","Nice to meet you","Pleasure to meet you","How are things (with you)?"],
         "responses": ["Hello,thank you for asking! How can I help you? I can also tell you a fitness joke :)","Good to see you again. How can I help you today? I can also tell you a fitness joke :)","Hi there, how can I help? I can also tell you a fitness joke :)"],
         "context": [""]
        },
        {"tag": "goodbye",
         "patterns": ["Bye","See you later","Goodbye","Nice chatting to you, bye","Till next time","Cheers","Talk to you later","Have a nice day","Take care","Catch you later"],
         "responses": ["See you!","Have a nice day","Bye! Come back again soon."],
         "context": [""]
        },
        {"tag": "thanks",
         "patterns": ["Thanks","Thank you","That's helpful","Awesome,thanks","A huge thank you","Thanks for helping me"],
         "responses": ["Happy to help!","Any time!","My pleasure"],
         "context": [""]
        },
        {"tag": "noanswer",
         "patterns": [],
         "responses": ["Sorry,can't understand you.","Please give me more info.","Not sure I understand.","Could you be more specific?"],
         "context": [""]
        },
        {"tag": "options",
         "patterns": ["options","How can you help me?","I need your advice","Give me some advice","advice","How could you help me?","What can you do?","What assistance do you provide?","What help do you provide?","How you can be helpful?","What can you do for me","What do you know","What do you specialize in?"],
         "responses": ["I can inform you on: a) membership rules, b) the time and location in which our center operates, c) types of available group fitness classes, d) how to book or cancel a group class, e) contact details to our managers. I answer FAQs and can also describe to you different types of exercises and gym equipment if you name any."],
         "context": [""]
        },
		{"tag": "membership_cancellation",
         "patterns": ["How do I cancel my membership?","I want to resign.","How to resign?","Notice period","membership_cancellation","I request cancellation","How to terminate the membership agreement?","How to withdra from the membership agreement?"],
         "responses": ["We hate to see you go! But if you must,the process is easy. You can fill out a cancellation form at the front desk of your home club, or send a letter (preferably via certified mail) to your club requesting cancellation. Memberships can't, unfortunately, be cancelled by email or phone. Please remember that your cancellation request is subject to any obligations of your membership agreement.No notice period is necessary on flexible monthly direct debit memberships. Once you have contacted your bank and cancelled the direct debit that funds your membership, your membership will be terminated immediately."],
         "context": [""]
        },
		{"tag": "membership_upgrade",
         "patterns": ["How do I upgrade my membership?","membership upgrade","I want to have better card options.","I would like to extend the scope of my offer.","I want to extend my fitness package."],
         "responses": ["Upgrading your membership has never been faster or easier. You can do it all online simply by visiting https://www.gymsharks/membershipupgrade. Or,stop by the club and our front desk staff can do it for you."],
         "context": [""]
        },
		{"tag": "membership_downgrade",
         "patterns": ["How do I downgrade my membership?","What can I do to pay less?","I do not need to go to the gym so often.","membership downgrade"],
         "responses": ["Stop by your club and club staff can downgrade your membership."],
         "context": [""]
        },
		{"tag": "online_account",
         "patterns": ["How do I log in to my account online?","How to use an online account?","online account"],
         "responses": ["That one is easy! Go to https://www.gymsharks/myaccount."],
         "context": [""]
        },
        {"tag": "payments",
         "patterns": ["How can I check my payment?","Are there any other charges?","How do I alter the collection date of my direct debit?","How much do I have to pay?","How much do I have to pay?","payments","Where do I go if I have questions or need help with the billing for my account?","How to get back my money?","How do I update or alter my bank details?","I would like my money back."],
         "responses": ["In finance-related matters,the easiest option would be to stop by the club where our front desk staff will help you out!","If the club is open, your best source of billing or membership information is to contact them directly. If your club is closed, please contact our Member Services Department (MSD@gymshark.com). Please note that the Member Services Department is open Monday through Friday from 9am - 6pm,CES. They will respond to your inquiry as soon as possible."],
         "context": [""]
        },
        {"tag": "amounts",
         "patterns": ["How much does the membership cost?","What are the prices for different packages?","What is membership cost per month?","amounts"],
         "responses": ["Gymshark Light: 35$; Gymshark Standard: 40$; Gymshark Plus: 45$","Gymshark Fitness really does charge as low as $35 dollars per month and up to as high as $45.00 for a Black Card membership (billing all members on the 17th of every month). On top of that,you will be billed $39 for the annual fee."],
         "context": [""]
        },
		{"tag": "amenities",
         "patterns": ["What amenities does Gymshark have?","What benefits do you have?","How can I benefit from you center?","Why should I become your client","What does your fitness center offer?","What is your offer?","Do you have showers"],
         "responses": ["We offer a wide range of services: a) fitness trainings certified instructors; b) digital classes through the Gymshark App for all members to provide guided workouts,workout tracking,c) well-equipped gym d) spacious and clean locker rooms as well as showers; e) free WiFi and sauna."],
         "context": [""]
        },
		{"tag": "help",
         "patterns": ["Could you help me?","give me a hand please","Can you help?","What can you do for me?","I need a support","I need a help","support me please","help"],
         "responses": ["Tell me how I can assist you.","Tell me your problem to assist you.","Yes sure, how can I support you."],
         "context": [""]
        },
		{"tag": "complaint",
         "patterns": ["have a complaint","I want to raise a complaint","there is a complaint about a service"],
         "responses": ["Please provide us with your complaint in order to assist you.","Please mention your complaint, we will reach you and sorry for any inconvenience caused."],
         "context": [""]
        },
		{"tag": "about",
         "patterns": ["what's your name","what should I call you","what's your name?","Who are you?","What are you?","what should I call you"],
         "responses": ["I'm Charlie, your AI Fitness Bot.","I'm an AI Asisstant that can guide you through membership rules, types of available fitness classes and FAQs"],
         "context": [""]
        },
		{"tag": "satisfaction",
         "patterns": ["I am not satisfied.","I am not happy with the classes."],
         "responses": ["Sorry to hear that. What can we do to improve? We will register your answer."],
         "context": [""]
        },
		{"tag": "age",
         "patterns": ["Does age matter?","How old do I need to be?","Age that is required","age","Do you have any offer for seniors?","Do you have any offer for seniors?","for seniors", "for children"],
         "responses": ["Our services and classes are tailored to various age groups: teenagers, adults and seniors. Since, irrespective of age, safety of our guests is of utmost importance, sports lovers below 18 need to submit parents' consent to join our club."],
         "context": [""]
        },
        {"tag": "dress_code",
         "patterns": ["What should I wear?","Is there any dress code?","What outfit can you recommend?","dress code"],
         "responses": ["We're all for people expressing themselves, but do ask that clothing that may be perceived as intimidating, revealing, or offensive not be worn in the club.","We  do not recommend clothing that may present safety hazards or damage equipment.","Examples of clothing that is not allowed include: open-toed shoes or sandals, mud-caked, greasy, or soiled shoes or clothing."],
         "context": [""]
        },
        {"tag": "childcare",
         "patterns": ["Do you offer childcare?","kids room","Are my kids allowed in the club while I’m working out?","take care of children?","leave you kids","childcare"],
         "responses": ["In order to keep our membership services at the highest level, we do offer childcare services, i.e. kids room available within 10am-5pm. "],
         "context": [""]
        },
        {"tag": "classes_types",
         "patterns": ["What classes do you offer?","What group classes do you offer?","enroll into a class","What classes can you recommend for me?","Can you list and describe the classes available in your club?","What fitness classes do you offer?","What group classes can you recommend?","types of classes you offer"],
         "responses": ["We offer yoga, full body fusion, circuit training, HIIT, water aerobics, cycling, kickboxing and zumba. If you would like me to explain to you what each type means, please type in the classes name."],
         "context": [""]
        },
        {"tag": "personal_training",
         "patterns": ["can I order a personal training?","I want to have a personal trainer.","do you have personal trainers?","personal trainer","personal training","personal session"],
         "responses": ["Professional Personal Trainers conduct our free Gym Intro sessions. This provides an opportunity to get instruction on a basic starter programme, meet team members and book a follow up free 30-minute personal training session."],
         "context": [""]
        },
        {"tag": "yoga",
         "patterns": ["Yoga","What is yoga?","Do you have yoga?"],
         "responses": ["Our offer includes yoga. The exercise itself consists of deliberate, concentrated movements and postures designed to promote flexibility, tone and strengthen muscles and align the body. Most often, breathing techniques are also encompassed along with the movements, allowing participants a relaxing experience coinciding with the movement."],
         "context": [""]
        },
        {"tag": "FULL_BODY_FUSION",
         "patterns": ["What is FULL BODY FUSION","FULL BODY FUSION","Do you have TBC?","Do you have Total Body Workout?","FULL BODY FUSION"],
         "responses": ["Our offer includes FULL BODY FUSION. This is a healthy mix of strength-training paired with cardio and pilates."],
         "context": [""]
        },
        {"tag": "CIRCUIT_TRAINING",
         "patterns": ["What is CIRCUIT TRAINING","CIRCUIT TRAINING","Do you have CIRCUIT TRAINING","CIRCUIT TRAINING","bike","cycle"],
         "responses": ["Circuit training classes are typically an interval-style, fast paced, shorter routine that does exactly as its name implies - training exercises that complete a circuit. Normally in this class setting, you complete one exercise (usually in a station) for anywhere from 30 seconds to a minute, and then move on to the next station/exercise for another 30 seconds to a minute,usually with a brief break in the routine once you complete one full circuit."],
         "context": [""]
        },
		{"tag": "HIIT",
         "patterns": ["What is HIIT","HIIT","Do you have HIIT","HIIT"],
         "responses": ["HIIT stands for High-Intensity Interval Training, and is an exercise strategy that alternates short periods of intense exercise movements, followed by less intense, but still active recovery periods. The goal with a HIIT class is to reach a sustained target heart rate for exercise, allowing you to quickly burn fat in a brief amount of time."],
         "context": [""]
        },
		{"tag": "WATER_AEROBICS",
         "patterns": ["What is WATER AEROBICS","Do you have WATER AEROBICS"],
         "responses": ["Water aerobics can be a really fun way to engage muscle endurance and strength in a low-impact setting. This aerobic style class usually involves light dumbbells and movements designed to get your heart pumping at a steady, consistent pace."],
         "context": [""]
        },
		{"tag": "CYCLING",
         "patterns": ["do you ride a bike?","indoor cycling classes?","I want to join cycling class","cycling","ride a bike"],
         "responses": ["A cycling class is great cardio workout that relies on a fitness center cycling machine,usually in a room designated for this type of fitness class. Often times, the class includes fast-paced upbeat tracks to help build the heart rate at different intervals over the course of the workout with alternating periods of sitting and standing, as well as adjusting the intensity or grade of the bike. Classes average around 45 minutes in length, and it's a great idea to bring a towel and water bottle with you to this class - you're going to need both!"],
         "context": [""]
        },
		{"tag": "ZUMBA",
         "patterns": ["I want zumba classes","I want to book a zumba class","ZUMBA"],
         "responses": ["A Zumba class offers a series of energetic dance routines that provide a great cardio workout by mixing low intensity and high intensity moves for an interval-style,calorie burning,dance fitness party! The biggest key to joining a Zumba class is to not be worried about your dance moves,because everyone else is on the same boat!"],
         "context": [""]
        },
		{"tag": "KICKBOXING",
         "patterns": ["do you have KICKBOXING","KICKBOXING","what is KICKBOXING","KICKBOXING"],
         "responses": ["Kickboxing is an adrenaline-pumping martial-arts style of fitness that provides a great cardiovascular workout and helps build endurance,coordination,tones muscles and core,all while working the heart and burning a lot of calories. In addition to all these great benefits,kickboxing classes also help with balance,flexibility and agility,and can even promote better self-defense."],
         "context": [""]
        },
        {"tag": "stamina",
         "patterns": ["what can I do to improve my health?","What can I do to improve my shape?","What can I do to improve my stamina?","stamina"],
         "responses": ["a) exercise, b) do yoga and meditate, c) listen to music. For more detailed tips go to https://www.gymshark/healthline"],
         "context": [""]
        },
        {"tag": "getting_started",
         "patterns": ["Can I visit to look around?"," Do I need an appointment?","Can I visit at any time?","Do I have any help if I am new to the gym?","start"],
         "responses": ["You are welcome to come and have a look round, at any time, just drop in during opening hours, no appointment is necessary. A gym intro with a Professional Personal Trainer is included within the joining price."],
         "context": [""]
        },
		 {"tag": "check_leave",
         "patterns": ["Is John Smith on leave?","Is Manish Kumar on leave?"],
         "responses": ["No,not on leave","Yes,on leave"],
         "context": [""]
        },
		 {"tag": "forgot_password",
         "patterns": ["I forgot my login password?","what to do when someone forgets Login password?","I forgot my Laptop password","Forgot Wifi password"],
         "responses": ["No worries! Please enter your email ,we will send a link to your email address."],
          "context": [""]
        },
        {"tag": "sign-up",
         "patterns": ["If I sign up today can I work out?","When can I start?","How long do I have to wait until my membership is until?","sign-up","login"],
         "responses": ["When you join you will receive immediate confirmation of your membership sent to your e-mail address. As soon as you are a member you can pop in and register your fingerprint, within 5 minutes you will be able to use the gym facilities."],
         "context": [""]
        },
		{"tag": "services",
         "patterns": ["Are there any other on site services?","services"],
         "responses": ["We offer other services such as beauty therapy, personal training and sports massage - perfect treats after exercising. You will find details and price lists for these services around the club and in our monthly newsletter."],
         "context": [""]
        },
		{"tag": "lockers",
         "patterns": ["do you have lockers?","do you provide lockers", "do I need a padlock to open a locker?"],
         "responses": ["We provide lockers to store your clothes and valuables. These lockers are for use whilst you are within the club ONLY and storage is not available to you overnight or during the day whilst you are off site. You are welcome to bring a padlock with you but please make sure it has an 8mm shackle."],
         "context": [""]
        },
		{"tag": "membership_freezing",
         "patterns": ["Can I put my membership on hold?","can I freeze my membership?","membership freeze","freezing membership"],
         "responses": ["We do not usually offer this facility. You must pay for your membership whether or not you use the gym. This is reflected in our moderate fees."],
         "context": [""]
        },
		{"tag": "online_application",
         "patterns": ["Do you have any application?","Have can I use your app?","How to login to your application?","do you have an online app?","app","application"],
         "responses": ["Our on-line facility and App are both quick and easy to use. You are able to book a Gym Intro, book classes, enquire about our personal trainers, look at your membership type, renew a paid in full membership. Please log in using the email and password you created when first joining."],
         "context": [""]
        },
		{"tag": "discounts",
         "patterns": ["Are there any student/group discounts available?","Will I get a discount","discount"],
         "responses": ["We believe our prices are extremely competitive and are therefore non-negotiable! The prices listed under the 'Join Now' tab of the website are our set membership types."],
         "context": [""]
        },
		{"tag": "classes_online",
         "patterns": ["How do I access online classes?","do you have online classes?","virtual classes","any online training programs"],
         "responses": ["Our online classes are broadcast live on Instagram. All our live Instagram workouts are saved to IGTV so you can go back and enjoy them in your own time - you don't have to follow them live."],
         "context": [""]
        },
		{"tag": "COVID-19",
         "patterns": ["What safety measures can I expect when you reopen?","COVID-19 Risk Assessment","COVID-19","pandemia","COVID"],
         "responses": ["The gym will be fully operational and compliant with government regulations. In addition, every one of our locations will be adhering to our own, strict commitments for COVID-safety.","Every staff member and instructor have their temperature checked and recorded in our staff safety log before their shift. Staff is required to wear masks during their shift. We have also installed multiple hand sanitising stations around the club, including 2 motion-activated hand sanatisers which are located as soon as you enter the gym."],
         "context": [""]
        },
		{"tag": "booking_classes",
         "patterns": ["Do I have to book classes","sign up for a class","how can I attend classes","book a class","sign up for a class"],
         "responses": ["Classes can be booked through the Member Area on the website.The vast majority of our classes are included within your membership. These can be booked in the Member Area of the website."],
         "context": [""]
        },
		{"tag": "equipment",
         "patterns": ["equipment","Treadmills","Ellipticals and Cross Trainers","Exercise Bikes","Indoor Cycles", "Recumbent Bikes","Stair Climbers & Steppers","Mat","do I have to bring my own mat?","Exercise Balls","Rowers","Dumbbells","power bar"],
         "responses": ["To see all our equipment, please go to https://www.gymequipment@gymshark.com"],
         "context": [""]
        },
		{"tag": "club_access",
         "patterns": ["Can I go to any Anytime Fitness with my membership card?","access","access to the gym"],
         "responses": ["yes, please come to us within 6:00am-23.00pm"],
         "context": [""]
        },
        {"tag": "purchase",
         "patterns": ["do you sell products?","do you have a shop?","what can I buy at the club reception area?","can I buy some water?","purchase"],
         "responses": ["Yes, you can buy WHEY protein, protein shales and protein bars. Water is sold in the multiple vending machines at the club."],
         "context": [""]
        },
        {"tag": "weight",
         "patterns": ["what can I do to lose weight","weight too high","weigh too much","weight","lose weight"],
         "responses": ["Besides physical activity, we recommend a proper diet. Please contact our dietician: diet@gymshark","Plase visit our website for recommended diets."],
         "context": [""]
        },
        {"tag": "COVID-19_restrictions",
         "patterns": ["How will I maintain social distancing in the gym?","COVID-19 restrictions","precautionary measures"],
         "responses": ["Equipment is spaced 2m apart where possible. There is also clear signange around the gym to remind members to maintain social distancing."],
         "context": [""]
        },
        {"tag": "health",
         "patterns": ["I have a health issue, can I exercise?","am ill", "health problems"],
         "responses": ["It will depend on your condition and medical clearance may need to be provided by your doctor.","It depends on how serious your health issue is."],
         "context": [""]
        },
        {"tag": "email_id",
         "patterns":["abx@gmail.com","abc@gymshark.com"],
         "responses":["Link has been shared. Please change your password"],
         "context": [""]
        },
        {"tag": "workout programme",
         "patterns": ["Will you design me a workout programme?","Is personal training available","workout programme","training program","programme"],
         "responses": ["Yes, we can assign you to a trainer and he will deisgn a personalized workout programme."],
         "context": [""]
        },
        {"tag": "disabilities",
         "patterns": ["Can I workout with a disability?","I am after an accident?","disabilities"],
         "responses": ["We are a state-of-the-art fitness center that offers programs that empower people with disabilities. GYMSHARK has an area where wheelchair-using athletes can exchange their wheelchair for a sports wheelchair. They also feature locker rooms with wide doorways for easier navigation.","Yes, we offer personal adaptive trainings and consultations/sessions with our physiotherapist."],
         "context": [""]
        },
        {"tag": "free_fitness_classes",
         "patterns": ["Are your fitness classes free?","free classes"],
         "responses": ["Our fitness classes are free for members and always have been. Once you join Gymsharkp, you can book any fitness class you like, free and unlimited."],
         "context": [""]
        },
        {"tag": "joining_age",
         "patterns": ["What age do you need to be to join?","joing age"],
         "responses": ["Due to insurance reasons, you must be 16 years old before becoming a member. Outside of that, you’re welcome at any age - because you’re never too old to keep fit and active."],
         "context": [""]
        },
        {"tag": "gym",
         "patterns": ["want to go to a gym","do you have a gym","is your gym well equipped","gym"],
         "responses": ["Our club offers a well-equipped, state-of-the-art gym. To see more details, go to our webpage: https://www.gymshark/gym"],
         "context": [""]
        },
        {"tag": "exercises",
         "patterns": ["What exercises should I do?","lunges","pushups","squats","dumbbell press","dumbbell rows","deadlifts","burpees","plank","exercises","exercise"],
         "responses": ["In order to get familiar with 10 exercises will rock your body, please visit our website: https://wwww.gymshark/exercises"],
         "context": [""]
        },
        {"tag": "connect_people",
         "patterns": ["I want to meet the head of your department","I want to talk to the manager.","I want to meet the office head.","connect"],
         "responses": ["I will just check if he/she is available or on leave."],
         "context": [""]
        },
        {"tag": "angry_client",
         "patterns": ["I am dissatisfied","want to file a complaint","want to lodge a complaint","am not happy with the service","want to change my instructor","angry"],
         "responses": ["Sorry to hear that! We'll do our best to make you happy. If you would like me to tell you a joke to make you smile, please type: joke time.","Sorry to hear that! Please email our manager: manager@gymshark.com and provide as many details as possible. Thank you! If you would like me to tell you a joke to make you smile, please type: joke time."],
         "context": [""]
        },
        {"tag": "solve_problems",
         "patterns": ["does not work","equiment does not work","air conditionaing is mulfunctioning","technical problem"],
         "responses": ["No worries! We're doing our best to fix the issue as soon as possible."],
         "context": [""]
        },
         {"tag": "funny",
         "patterns": ["are you funny?","can you be funny?","can you tell me a joke?","joke time","joke"],
         "responses": ["Sure! I go to the gym religiously ... About twice a year, around holidays.","Sure! Why are there no haunted gyms? ... Because everyone inside is exorcising.","Sure! It's been six months since I joined the gym, and still no progress! ... I am going there in-person tomorrow to see what is going on.","Sure! Why did the gym-goer get arrested? ... Because she killed her workout.","Sure! What exercise do hairdressers do in the gym? ... Curls. ","Sure! What is a banana's favorite gymnastic move? ... The splits!","Sure! Why was the farmer get kicked out of the gym? ... Because he was destroying his calves."],
         "context": [""]
          },
        {"tag": "HR_related_problem",
         "patterns": ["problem related to Job design and analysis","am looking for a job","job application", "want a job", "job seeker","query based on Workforce planning","Training and development issues are to be handled","Compensation and benefits of the working employee","Legal issues of department like accidents in the company"],
         "responses": ["Please Contact the HR team to solve this problem. They will provide you with further details."],
         "context": [""]
        },
        {"tag": "maintainence",
         "patterns": ["maintainence related queries recorded","is not working","lift is not working","microphone misfuctioning","AC does not work","air conditioning does not work","maintainence"],
         "responses": ["Apologies! We are doing our best to fix all the improprieties asap."],
         "context": [""]
        },
        {"tag": "commission",
         "patterns": ["what is the instuctor's salary?","how much does an instructor earn","instructor's remuneration","instructor's compensation"],
         "responses": ["I can't reveal such details. Please email hr@gymshark.com"],
         "context": [""]
        },
        {"tag": "invalid",
         "patterns": ["Marry me","I love You","date me","chat with me","I am bored"],
         "responses": ["Please be serious. Ask me a club-related query."],
         "context": [""]
        },
        {"tag": "noans",
         "patterns": ["why","how","when","I","you"],
         "responses": ["Cannot understand your question","please elaborate your question"],
         "context": [""]
        },
        {"tag": "members number",
         "patterns": ["how many members does the club have at present?","number of members","number of clients"],
         "responses": ["About 2,000."],
         "context": [""]
        },
        {"tag": "about",
         "patterns": ["how you doing?","how are you","about"],
         "responses": ["Thanks For Asking!How can I help you?"],
         "context": [""]
        },
        {"tag":"configuration",
         "patterns":["configuration","How to configure my laptop","software configuration of laptop","steps to configure laptop","How to configure my computer","software configuration of computer","steps to configure computer","How to configure my desktop","software configuration of desktop","steps to configure desktop"],
         "responses":["search tab->control panel->select specific application->download update->give permission"],
         "context":[""]
        },
        {"tag": "weather",
         "patterns": ["what is the weather today?","weather","can you tell the weather","weather"],
         "responses": ["As I am not weather sensitive, please go to accuweather."],
         "context": [""]
        },
        {"tag": "leave",
         "patterns": ["Is Michel Sharma on leave?","Is Siddhart Roy present today?","Is Shantanu Bhatt in office?"],
         "responses": ["Give me a moment!I will just check","yes","no"],
         "context": [""]
        },
        {"tag": "hours",
         "patterns": ["hours","Opening hours of the gym?","when does the gym open","fitness center opening time","closing time","when does it close","closing hours"],
         "responses": ["Every day 6:00am-23.00pm"],
         "context": [""]
        },
		{"tag": "classes time",
         "patterns": ["when are my favourite class?","when do my classes start?","where can I check my classes timetable","classes schedule","timetable","classes time"],
         "responses": ["To check group classes timetable, go to https://www.gymsharks/groupclasses"],
         "context": [""]
        },
        {"tag": "premises",
         "patterns": ["Where is Head IT cabin?","Where is AI department","Where is Project head department?","where is cafeteria","guide me to the canteen","premises"],
         "responses": ["Block-A 3rd floor 1st room","Block-B 2nd Floor","Block-D Ground Floor"],
         "context": [""]
        },
		{"tag": "showers",
         "patterns": ["Do you have showers?","showers","hairdryer","toilet"],
         "responses": ["Yes we provide comfortable changing facilities which include showers, toilets, hairdryers and plug sockets (for those who like to bring their own)."],
         "context": [""]
        },
		{"tag": "induction",
         "patterns": ["Will I be shown how to use the equipment?","will you instruct me on how to use the machines?","induction"],
         "responses": ["Yes, every new member will receive a free induction session to show you how to use the equipment. We strongly recommend an induction if you have not been a member of a gym before."],
         "context": [""]
        },
		{"tag": "sunbeds",
         "patterns": ["Do you have sunbeds?","Can I sunbathe at your club?","sunbeds"],
         "responses": ["Most of our gyms have sunbeds – please ask your receptionist for more details. Members must have reached the age of 18 to use our sunbeds."],
         "context": [""]
        },
		{"tag": "parking",
         "patterns": ["do you provide parking?","parking","parking lot","parking space"],
         "responses": ["Yes, we offer lots of free parking at Gymshark. Please ask in club for a parking permit/registration entry information to avoid charges."],
         "context": [""]
        },
		{"tag": "entrance",
         "patterns": ["How do I get into the gym?","entrance"],
         "responses": ["Simply enter the gym via the designated entrance, where you'll either be greeted by a receptionist."],
         "context": [""]
        },
		{"tag": "towel",
         "patterns": ["Do you supply paper towel dispensers to wipe down equipment?","paper towel"],
         "responses": ["Unlike other budget gyms we supply paper towels in each gym because we want to keep the gyms as tidy, as safe and as comfortable as possible. You can also rent a standard towel for an additional fee."],
         "context": [""]
        },
		{"tag": "staff",
         "patterns": ["is the gym staffed","do you have onsite staff","gym supervisors","gym employees","staff"],
         "responses": ["Our sites are staffed by PTs and a manager during daytime hours. Our 24hr sites use remotely monitored CCTV out of hours."],
         "context": [""]
        },
		{"tag": "videos_pictures",
         "patterns": ["can I take photos?", "can I record a video?","take pictures","videos"],
         "responses": ["Please ensure members around you are aware. Please do not take photographs or videos on the premises or post remarks or imagery to the internet that could identify another Member"],
         "context": [""]
        },
		{"tag": "refer_a_friend",
         "patterns": ["refer a friend","Are there any benefits if a refer a friend?", "friend referral","I would like to bring my friend.","I would like to bring a family member."],
         "responses": ["Refer a friend or family member and they pay no joining fee! The new joiner must use the members unique referral code."],
         "context": [""]
        },
		{"tag": "comeback",
         "patterns": ["If I cancel and then decide a few months later that I would like to rejoin, do I have to pay the joining fee?", "cancel and would like to re-join","cancel and would like to come back","re-joining"],
         "responses": ["The joining fee will be required in order to cover the cost of getting a new direct debit set up and your membership active. You are technically a new member to the gym."],
         "context": [""]
        },
		{"tag": "terms_and_conditions",
         "patterns": ["where can I find your terms and conditions", "I wan to read your terms and conditions","T&C", "terms and conditions"],
         "responses": ["Please see our abbreviate T&Cs here: https://www.gymshark/terms-conditions"],
         "context": [""]
        },
		{"tag": "trial",
         "patterns": ["can I try before I buy", "do you offer one day passes?","can I visit you for free before I become a member","trial","test"],
         "responses": ["You can try out the gym for day with day passes which can be purchased for $5, or we offer free tours which can be booked in advance via the website."],
         "context": [""]
        },
		{"tag": "thoretical_workshop",
         "patterns": ["do you offer any theoretical workshops", "do you offer any webinar","online meetings","online events"],
         "responses": ["From time to time we organize online workshops devoted to healthy lifestyle and exercising hygiene. To see the list of current online events visit htts://www.gymshark/events"],
         "context": [""]
        },
		{"tag": "contact",
         "patterns": ["how to contact you?","your contact details","contact"],
         "responses": ["If you have any queries please get in contact us through facebook.","Emails and telephone numbers to specific departments and coordinators are available on our gym page."],
         "context": [""]
        },
		{"tag": "locations",
         "patterns": ["what is your registered address?","what is your location","location"],
         "responses": ["Our headquarters address: GYMSHARK LIMITED; Unknown Road; Wonderland; WD1 2TF. You can always visit our other locations: GYMSHARK Bedford, GYMSHARK Crewe and GYMSHARK Kensington."],
         "context": [""]
        },
		{"tag": "collective_offer",
         "patterns": ["do you offer corporate scheme","offer for groups","lower price for a group","collective offer","group offer"],
         "responses": ["Even though our membership fees are low, we can always do something to make your workforce/team a healthier one at a lower price."],
         "context": [""]
        },
		{"tag": "interaction",
         "patterns": ["can you entertain me","can you play a game with me","interaction","entertain me","entertainment"],
         "responses": ["No, I can't play a game, but I can tell you a fitness joke. If you would like to see how funny my jokes are, please type joke time."],
         "context": [""]
        },
		
        {"tag":"knowledge",
         "patterns":["How to improve instructors and members domain knowledge","improving domain knowledge of club members","knowledge"],
         "responses":["set up key meetings and workshop, create a shared drive for information, hold informal sharing session"],
         "context":[""]
    }
	
   ]
}